src/cf/InformationRegisters/ИдентификаторыВложенийWord.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИдентификаторыВложенийWord</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ИдентификаторыВложенийWord/Ext/ManagerModule.bsl
// Добавляет запись.
//
Процедура УстановитьИдентификаторВложения(Файл, Идентификатор) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Запись = РегистрыСведений.ИдентификаторыВложенийWord.СоздатьМенеджерЗаписи();
	Запись.Файл = Файл;
	Запись.Прочитать();
	Запись.Файл = Файл;
	Запись.Идентификатор = Идентификатор;
	Запись.Записать(Истина);
	
КонецПроцедуры

// Возвращает идентификатор  вложения по файлу.
//
Функция ПолучитьИдентификаторВложения(Файл) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Запись = РегистрыСведений.ИдентификаторыВложенийWord.СоздатьМенеджерЗаписи();
	Запись.Файл = Файл;
	Запись.Прочитать();
	Если Не Запись.Выбран() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Запись.Идентификатор;
	
КонецФункции

// Удаляет запись.
//
Процедура УдалитьИдентификаторВложения(Файл) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Запись = РегистрыСведений.ИдентификаторыВложенийWord.СоздатьМенеджерЗаписи();
	Запись.Файл = Файл;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Запись.Удалить();
	КонецЕсли;
	
КонецПроцедуры

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#КонецЕсли
